src/Catalogs/Roles_AccessRoles/Roles_AccessRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_AccessRoles</name>
  <basedOn>Catalog.Roles_AccessProfiles</basedOn>
  <basedOn>Catalog.Users</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SetRightsForNewNativeObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRightsForAttributesAndTabularSectionsByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubordinateObjectsHaveIndependentRights</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfigRoles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Configuration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>ObjectType</name>
      <type>
        <types>EnumRef.Roles_MetadataTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightName</name>
      <type>
        <types>EnumRef.Roles_Rights</types>
      </type>
    </attributes>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectPath</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightValue</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Disable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectSubtype</name>
      <type>
        <types>EnumRef.Roles_MetadataSubtype</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RestrictionByCondition</name>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Fields</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Templates</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Template</name>
      <type>
        <types>CatalogRef.Roles_Templates</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LangInfo</name>
    <attributes>
      <name>LangCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LangDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Roles_AccessRoles/ObjectModule.bsl
Procedure OnCopy(CopiedObject)
	For Each Row In Rights Do
		NewID = New UUID;
		FindRestrictions = RestrictionByCondition.FindRows(New Structure("RowID", Row.RowID));
		For Each Restriction In FindRestrictions Do
			Restriction.RowID = NewID;
		EndDo;
		Row.RowID = NewID;
	EndDo;
EndProcedure
